{
  "Hungarian": "Magyar",
  "English": "Angol",
  "Home": "Kezdőoldal",
  "About": "Magamról",
  "Skills": "Készségek",
  "References": "Referencia munkák",
  "Education-Works": "Tanulmányok/Munka",
  "ContactMe": "Kapcsolat",


  "CVDownload": "Önéletrajz letöltése",
  "Download": "Letöltés",

  "AboutModule": {
    "Welcome": "Szia! A nevem Kismarczi József, ",
    "CallMeMarci": "de hívhatsz Marcinak",
    "Experiences": "Full-stack fejelsztő vagyok - Angular & C#",
    "Description": "Kismarczi József vagyok és 2018 óta foglalkozok aktívan fejlesztéssel.Képességem kiterjed a webtervezési és -fejlesztési elvek megvalósítására, hogy megbízható szoftvereket hozzak létre mind backend mind front-end oldalon. A maketteket számos eszköz segítségével keltem életre, mint például a HTML5, CSS3, SCSS, JavaScript (ES6), TypeScript, jQuery és Angular. Képes vagyok a technikai kérdések világos és érthető kommunikálásában a fejlesztői csapat felé. Reszponzív és felhasználóbarát webhelyeket és alkalmazásokat készítek, miközben figyelemmel kísérem a teljesítményüket és megoldom a problémákat. A szervezett munkafolyamat fenntartásához olyan verziókezelő eszközöket használok, mint a Git. Ezenkívül tapasztalattal rendelkezem a .net framework használatában is. Back-end-en is igyekszem betartani a SOLID elveket, clean code szabályokat és a design pattern-ek segítségével jobb teljesítménnyel és átláthatóbb kóddal létrehozni egy WEB API-t."
  },

  "GetInTouch": "vegye fel velem a kapcsolatot",
  "EmailMe": "Küldjön Email-t",
  "MyLocation": "Magyarország, Szeged",

  "Workplaces": "Munkahelyek",
  "ActualJob": "Signal Iduna | 2022 - Mostanáig",
  "FullStackDeveloper": "Full stack fejlesztő",
  "FrontEndDeveloper": "Fornt-end fejlesztő",
  "SignalIdunaDescription": "biztosítási programok karbantartása",
  "NewlineDescription": "Közforgalmi menetrend kelezelő rendszer weboldalak fejlesztése és karbantartása",
  "Education": "Oktatás",
  "EducationDescription" : "Mindig is érdekelt a programozás, ezért elvégeztem egy gyakorlatorientált öt hónapos tanfolyamot a Flow akadémián, hogy programozást tanuljak. előtte egyedül tanultam programozni.",
  "UdemyCourses": "Udemy kúrzusok"


}
